# Dockerfile - описание image (образа) проекта
# Image (образ) - служит только для чтения

# Базируем образ на node
FROM node

# Объявляем рабочую директорию приложения (где сейчас работаем)
WORKDIR /app

COPY package.json /app

# Устанавливаем зависимости
# RUN - Для сборки образа
RUN npm install

# Копируем файлы/папки из проекта в docker image
# КОПИРУЕМ откуда куда(место в образе)
COPY . .

# Задаем значение для переменной PORT(process.env.PORT)
ENV PORT 3000

# Указываем порт у приложения
# $PORT - обращаемся к переменной выше
EXPOSE $PORT

# Volume(том) - папка на локальной машине
# служит для того, чтобы данные существовали вне зависимости от контейнеров
# Указываем путь до volume
VOLUME ["/app/data"]

# Запуск команд
# CMD - Для запуска образа
CMD ["node", "app.js"]
